//arrow function
//هذه الطرق لا تعمل الا اذا استعملنا متغير واحد فقط
// function بعض طرق كتابة 
let x = () => {
    return 25
}
console.log(x()) //25

//----------------------------

let x1 = () => 100;

console.log(x1()) //100

//---------------------------------

let x2 = _ => 'hello ';

console.log(x2());//hello

//--------------------------------

let x3 = num => num * 2;

console.log(x3(32));//64

//-----------------------------

let x4 = (num , num2) => num * num2;
console.log(x4(2,60));//120

//------------------------------






